@matifali i did below are the logs and videos

https://github.com/user-attachments/assets/a4bbdcea-8e31-4ae6-b309-7caa3939ebe3

```bash
➜  proxmox-linux git:(Proxmox) ✗ coder list
WORKSPACE                  TEMPLATE      STATUS   HEALTHY  LAST BUILT  CURRENT VERSION          OUTDATED  STARTS AT  STOPS AFTER
  iamrajiv/test            proxmox-test  Started  true     6m          wizardly_proskuriakova2  false
  iamrajiv/test-workspace  proxmox-test  Started  true     5m          wizardly_proskuriakova2  false
➜  proxmox-linux git:(Proxmox) ✗ coder show test
┌────────────────────────────────────────────────────────────────┐
│ RESOURCE                       STATUS  HEALTH  VERSION  ACCESS │
├────────────────────────────────────────────────────────────────┤
│ null_resource.mock_proxmox_vm                                  │
└────────────────────────────────────────────────────────────────┘
➜  proxmox-linux git:(Proxmox) ✗
```

```bash
➜  proxmox-linux git:(Proxmox) ✗ terraform plan
data.coder_parameter.network_bridge: Reading...
data.coder_workspace_owner.me: Reading...
data.coder_parameter.datastore: Reading...
data.coder_parameter.proxmox_node: Reading...
data.coder_parameter.cpu_cores: Reading...
data.coder_workspace.me: Reading...
data.coder_parameter.vm_template: Reading...
data.coder_parameter.memory_mb: Reading...
data.coder_workspace_owner.me: Read complete after 0s [id=d5332a11-b5b2-4e35-bb7d-96e058b5d60c]
data.coder_parameter.proxmox_node: Read complete after 0s [id=357576f4-65d6-423f-b4b2-7cc4952f74ee]
data.coder_parameter.disk_size: Reading...
data.coder_workspace.me: Read complete after 0s [id=b0b550b9-f0a8-4b7c-be45-f7b27ff3ddea]
data.coder_parameter.memory_mb: Read complete after 0s [id=112249af-0074-4ab0-bdae-2a158357847a]
data.coder_parameter.network_bridge: Read complete after 0s [id=fa18ec4e-86c7-46f7-bcf4-7d8ee2cc652e]
data.coder_parameter.cpu_cores: Read complete after 0s [id=2f817d0e-5f45-4b82-a15e-1d85d02c28b9]
data.coder_parameter.vm_template: Read complete after 0s [id=34a88984-d1ec-4674-a67b-a27d189fb907]
data.coder_parameter.datastore: Read complete after 0s [id=eb96a6eb-bc36-4cbe-8db4-79070859c500]
data.coder_parameter.disk_size: Read complete after 0s [id=3b60c34f-c721-4eec-a12f-f020ad1c25a6]
module.jetbrains_gateway[0].data.coder_workspace_owner.me: Reading...
module.jetbrains_gateway[0].data.coder_workspace.me: Reading...
module.jetbrains_gateway[0].data.coder_parameter.jetbrains_ide: Reading...
module.jetbrains_gateway[0].data.coder_workspace_owner.me: Read complete after 0s [id=55012dcc-aefc-45b9-889d-4216048fe8fb]
module.jetbrains_gateway[0].data.coder_workspace.me: Read complete after 0s [id=4e6903c9-087e-4f46-85b8-9cbb02bd03f0]
module.jetbrains_gateway[0].data.coder_parameter.jetbrains_ide: Read complete after 0s [id=bc9ecd5a-4402-4e1c-b147-eeafeac29019]

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # coder_agent.main[0] will be created
  + resource "coder_agent" "main" {
      + api_key_scope           = "all"
      + arch                    = "amd64"
      + auth                    = "token"
      + connection_timeout      = 120
      + id                      = (known after apply)
      + init_script             = (known after apply)
      + os                      = "linux"
      + startup_script          = <<-EOT
            set -e

            sudo systemctl enable --now qemu-guest-agent

            if [ ! -f ~/.init_done ]; then
              sudo apt-get update
              sudo apt-get install -y curl wget git build-essential
              touch ~/.init_done
            fi
        EOT
      + startup_script_behavior = "non-blocking"
      + token                   = (sensitive value)

      + display_apps (known after apply)

      + metadata {
          + display_name = "CPU Usage"
          + interval     = 5
          + key          = "cpu"
          + script       = "coder stat cpu"
          + timeout      = 5
        }
      + metadata {
          + display_name = "Memory Usage"
          + interval     = 5
          + key          = "memory"
          + script       = "coder stat mem"
          + timeout      = 5
        }
      + metadata {
          + display_name = "Disk Usage"
          + interval     = 600
          + key          = "disk"
          + script       = "coder stat disk --path $HOME"
          + timeout      = 30
        }
    }

  # random_password.vm_password will be created
  + resource "random_password" "vm_password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = true
      + upper       = true
    }

  # module.code-server[0].coder_app.code-server will be created
  + resource "coder_app" "code-server" {
      + agent_id     = (known after apply)
      + display_name = "code-server"
      + external     = false
      + hidden       = false
      + icon         = "/icon/code.svg"
      + id           = (known after apply)
      + open_in      = "slim-window"
      + order        = 1
      + share        = "owner"
      + slug         = "code-server"
      + subdomain    = false
      + url          = "http://localhost:13337/"

      + healthcheck {
          + interval  = 5
          + threshold = 6
          + url       = "http://localhost:13337/healthz"
        }
    }

  # module.code-server[0].coder_script.code-server will be created
  + resource "coder_script" "code-server" {
      + agent_id           = (known after apply)
      + display_name       = "code-server"
      + icon               = "/icon/code.svg"
      + id                 = (known after apply)
      + run_on_start       = true
      + run_on_stop        = false
      + script             = <<-EOT
            #!/usr/bin/env bash

            EXTENSIONS=("")
            BOLD='\033[0;1m'
            CODE='\033[36;40;1m'
            RESET='\033[0m'
            CODE_SERVER="/tmp/code-server/bin/code-server"

            # Set extension directory
            EXTENSION_ARG=""
            if [ -n "" ]; then
              EXTENSION_ARG="--extensions-dir="
              mkdir -p ""
            fi

            function run_code_server() {
              echo "👷 Running code-server in the background..."
              echo "Check logs at /tmp/code-server.log!"
              $CODE_SERVER "$EXTENSION_ARG" --auth none --port "13337" --app-name "code-server" > "/tmp/code-server.log" 2>&1 &
            }

            # Check if the settings file exists...
            if [ ! -f ~/.local/share/code-server/User/settings.json ]; then
              echo "⚙️ Creating settings file..."
              mkdir -p ~/.local/share/code-server/User
              if command -v jq &> /dev/null; then
                echo "{}" | jq '.' > ~/.local/share/code-server/User/settings.json
              else
                echo "{}" > ~/.local/share/code-server/User/settings.json
              fi
            fi

            # Apply/overwrite template based settings
            echo "⚙️ Creating machine settings file..."
            mkdir -p ~/.local/share/code-server/Machine
            if command -v jq &> /dev/null; then
              echo "{}" | jq '.' > ~/.local/share/code-server/Machine/settings.json
            else
              echo "{}" > ~/.local/share/code-server/Machine/settings.json
            fi

            # Check if code-server is already installed for offline
            if [ "false" = true ]; then
              if [ -f "$CODE_SERVER" ]; then
                echo "🥳 Found a copy of code-server"
                run_code_server
                exit 0
              fi
              # Offline mode always expects a copy of code-server to be present
              echo "Failed to find a copy of code-server"
              exit 1
            fi

            # If there is no cached install OR we don't want to use a cached install
            if [ ! -f "$CODE_SERVER" ] || [ "false" != true ]; then
              printf "${BOLD}Installing code-server!\n"

              # Clean up from other install (in case install prefix changed).
              if [ -n "$CODER_SCRIPT_BIN_DIR" ] && [ -e "$CODER_SCRIPT_BIN_DIR/code-server" ]; then
                rm "$CODER_SCRIPT_BIN_DIR/code-server"
              fi

              ARGS=(
                "--method=standalone"
                "--prefix=/tmp/code-server"
              )
              if [ -n "" ]; then
                ARGS+=("--version=")
              fi

              output=$(curl -fsSL https://code-server.dev/install.sh | sh -s -- "${ARGS[@]}")
              if [ $? -ne 0 ]; then
                echo "Failed to install code-server: $output"
                exit 1
              fi
              printf "🥳 code-server has been installed in /tmp/code-server\n\n"
            fi

            # Make the code-server available in PATH.
            if [ -n "$CODER_SCRIPT_BIN_DIR" ] && [ ! -e "$CODER_SCRIPT_BIN_DIR/code-server" ]; then
              ln -s "$CODE_SERVER" "$CODER_SCRIPT_BIN_DIR/code-server"
            fi

            # Get the list of installed extensions...
            LIST_EXTENSIONS=$($CODE_SERVER --list-extensions $EXTENSION_ARG)
            readarray -t EXTENSIONS_ARRAY <<< "$LIST_EXTENSIONS"
            function extension_installed() {
              if [ "false" != true ]; then
                return 1
              fi
              for _extension in "${EXTENSIONS_ARRAY[@]}"; do
                if [ "$_extension" == "$1" ]; then
                  echo "Extension $1 was already installed."
                  return 0
                fi
              done
              return 1
            }

            # Install each extension...
            IFS=',' read -r -a EXTENSIONLIST <<< "${EXTENSIONS}"
            for extension in "${EXTENSIONLIST[@]}"; do
              if [ -z "$extension" ]; then
                continue
              fi
              if extension_installed "$extension"; then
                continue
              fi
              printf "🧩 Installing extension ${CODE}$extension${RESET}...\n"
              output=$($CODE_SERVER "$EXTENSION_ARG" --force --install-extension "$extension")
              if [ $? -ne 0 ]; then
                echo "Failed to install extension: $extension: $output"
                exit 1
              fi
            done

            if [ "false" = true ]; then
              if ! command -v jq > /dev/null; then
                echo "jq is required to install extensions from a workspace file."
                exit 0
              fi

              WORKSPACE_DIR="$HOME"
              if [ -n "" ]; then
                WORKSPACE_DIR=""
              fi

              if [ -f "$WORKSPACE_DIR/.vscode/extensions.json" ]; then
                printf "🧩 Installing extensions from %s/.vscode/extensions.json...\n" "$WORKSPACE_DIR"
                # Use sed to remove single-line comments before parsing with jq
                extensions=$(sed 's|//.*||g' "$WORKSPACE_DIR"/.vscode/extensions.json | jq -r '.recommendations[]')
                for extension in $extensions; do
                  if extension_installed "$extension"; then
                    continue
                  fi
                  $CODE_SERVER "$EXTENSION_ARG" --force --install-extension "$extension"
                done
              fi
            fi

            run_code_server
        EOT
      + start_blocks_login = false
      + timeout            = 0
    }

  # module.jetbrains_gateway[0].coder_app.gateway will be created
  + resource "coder_app" "gateway" {
      + agent_id     = (known after apply)
      + display_name = "IntelliJ IDEA Ultimate"
      + external     = true
      + hidden       = false
      + icon         = "/icon/intellij.svg"
      + id           = (known after apply)
      + open_in      = "slim-window"
      + order        = 2
      + share        = "owner"
      + slug         = "gateway"
      + url          = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid provider configuration
│
│ Provider "registry.terraform.io/bpg/proxmox" requires explicit configuration.
│ Add a provider block to the root module and configure the provider's required
│ arguments as described in the provider documentation.
│
╵
╷
│ Error: Missing Proxmox VE API Endpoint
│
│   with provider["registry.terraform.io/bpg/proxmox"],
│   on <empty> line 0:
│   (source code not available)
│
│ The provider cannot create the Proxmox VE API client as there is a missing or
│ empty value for the API endpoint. Set the host value in the configuration or
│ use the PROXMOX_VE_ENDPOINT environment variable. If either is already set,
│ ensure the value is not empty.
╵
```
